---
kind: type
id: T:Autodesk.Revit.DB.Lighting.CircleLightShape
source: html/6dda7b94-a8cc-2947-31a7-0e0d60766c71.htm
---
# Autodesk.Revit.DB.Lighting.CircleLightShape

This class encapsulates a circle light shape.

## Syntax (C#)
```csharp
public class CircleLightShape : LightShape
```